sdaiTestArrayByItr(Sdai_ItrId*)
\details
Determines whether the element value in a specified array is set.
The element of the array is determined with an iterator object.
\param iterator [in] An iterator that defined the position of the element in the array.
\returns sdaiTRUE if the element with the specified index has a set value; otherwise, the function returns sdaiFALSE.